podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/1.stage1Folder/peripherals/PORTB_MKE15Z7.svd.xml
            <register>
               <name>GPCLR</name>
               <description>Global Pin Control Low Register</description>
               <addressOffset>0x80</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>GPWD</name>
                     <description>Global Pin Write Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>GPWE</name>
                     <description>Global Pin Write Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Corresponding Pin Control Register is not updated with the value in GPWD</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Corresponding Pin Control Register is updated with the value in GPWD</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>GPCHR</name>
               <description>Global Pin Control High Register</description>
               <addressOffset>0x84</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>GPWD</name>
                     <description>Global Pin Write Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>GPWE</name>
                     <description>Global Pin Write Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Corresponding Pin Control Register is not updated with the value in GPWD</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Corresponding Pin Control Register is updated with the value in GPWD</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ISFR</name>
               <description>Interrupt Status Flag Register</description>
               <addressOffset>0xA0</addressOffset>
               <fields>
                  <field>
                     <name>ISF</name>
                     <description>Interrupt Status Flag</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Configured interrupt is not detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Configured interrupt is detected. If the pin is configured to generate a DMA request, then the corresponding flag will be cleared automatically at the completion of the requested DMA transfer. Otherwise, the flag remains set until a logic 1 is written to the flag. If the pin is configured for a level sensitive interrupt and the pin remains asserted, then the flag is set again immediately after it is cleared</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFER</name>
               <description>Digital Filter Enable Register</description>
               <addressOffset>0xC0</addressOffset>
               <fields>
                  <field>
                     <name>DFE</name>
                     <description>Digital Filter Enable</description>
                     <bitOffset>0</bitOffset>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Digital filter is disabled on the corresponding pin and output of the digital filter is reset to zero</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Digital filter is enabled on the corresponding pin, if the pin is configured as a digital input</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFCR</name>
               <description>Digital Filter Clock Register</description>
               <addressOffset>0xC4</addressOffset>
               <fields>
                  <field>
                     <name>CS</name>
                     <description>Clock Source</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Digital filters are clocked by the bus clock</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Digital filters are clocked by the LPO clock</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DFWR</name>
               <description>Digital Filter Width Register</description>
               <addressOffset>0xC8</addressOffset>
               <fields>
                  <field>
                     <name>FILT</name>
                     <description>Filter Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
